{
    "Purpose": "Propósito",
    "Architecture": "Arquitectura",
    "Features": "Características",
    "Module Isolation": "Aislamiento de Módulos",
    "Modular Framework v1.0": "Framework Modular v1.0",
    "Build": "Construir",
    "Modular": "Modular",
    "OAuth2 Modules": "Módulos OAuth2",
    "Elymod is a lightweight mini-framework designed specifically for building": "Elymod es un mini-framework ligero diseñado específicamente para construir",
    "independent modules": "módulos independientes",
    "for OAuth2 Passport servers. Each module is self-contained with its own dependencies, licensing, and functionality.": "para servidores OAuth2 Passport. Cada módulo es autónomo con sus propias dependencias, licencias y funcionalidad.",
    "Explore Architecture": "Explorar Arquitectura",
    "Self-contained modules": "Módulos autónomos",
    "Laravel Bridge": "Puente Laravel",
    "Familiar Artisan commands": "Comandos Artisan familiares",
    "Dependency Isolation": "Aislamiento de Dependencias",
    "No parent dependency conflicts": "Sin conflictos de dependencias padre",
    "OAuth2 Ready": "Listo para OAuth2",
    "Passport integration": "Integración Passport",
    "Purpose: Modular OAuth2 Extension Framework": "Propósito: Framework de Extensión Modular OAuth2",
    "Elymod is specifically designed to extend": "Elymod está diseñado específicamente para extender",
    "OAuth2 Passport Authorization Servers": "Servidores de Autorización OAuth2 Passport",
    "with pluggable modules. Each module is completely independent with its own:": "con módulos enchufables. Cada módulo es completamente independiente con su propio:",
    "Independent Dependencies": "Dependencias Independientes",
    "Modules install dependencies in their own vendor directory, never relying on the parent application.": "Los módulos instalan dependencias en su propio directorio vendor, nunca dependiendo de la aplicación padre.",
    "Separate Licensing": "Licencias Separadas",
    "Each module can have its own license, allowing different teams to develop and distribute modules independently.": "Cada módulo puede tener su propia licencia, permitiendo que diferentes equipos desarrollen y distribuyan módulos independientemente.",
    "Self-Contained Functionality": "Funcionalidad Autónoma",
    "Modules include all necessary code, configuration, and assets. No shared codebase conflicts.": "Los módulos incluyen todo el código, configuración y recursos necesarios. Sin conflictos de código base compartido.",
    "The Problem We Solve": "El Problema que Resolvemos",
    "Traditional Module Systems": "Sistemas de Módulos Tradicionales",
    "Modules depend on parent application dependencies, causing version conflicts and breaking changes.": "Los módulos dependen de las dependencias de la aplicación padre, causando conflictos de versiones y cambios disruptivos.",
    "Elymod Solution": "Solución Elymod",
    "Each module is truly independent. Dependencies are installed within the module, never searching the parent vendor.": "Cada módulo es verdaderamente independiente. Las dependencias se instalan dentro del módulo, nunca buscando en el vendor padre.",
    "Architecture: Independent Module Framework": "Arquitectura: Framework de Módulos Independientes",
    "Elymod provides a complete Laravel-like environment for each module, powered by Laravel Runtime bridge.": "Elymod proporciona un entorno completo similar a Laravel para cada módulo, impulsado por el puente Laravel Runtime.",
    "Dependency Flow": "Flujo de Dependencias",
    "OAuth2 Passport Server": "Servidor OAuth2 Passport",
    "Main application that loads modules": "Aplicación principal que carga módulos",
    "Module (Shop/Auth/Users)": "Módulo (Tienda/Autenticación/Usuarios)",
    "Independent module with own dependencies": "Módulo independiente con sus propias dependencias",
    "Depends on:": "Depende de:",
    "Elymod Framework": "Framework Elymod",
    "Mini-framework with Laravel Runtime": "Mini-framework con Laravel Runtime",
    "Provides:": "Proporciona:",
    "Artisan commands, Service Container, etc.": "Comandos Artisan, Contenedor de Servicios, etc.",
    "Laravel Runtime Bridge": "Puente Laravel Runtime",
    "Familiar Artisan Experience": "Experiencia Artisan Familiar",
    "Laravel Runtime provides a minimal Laravel bridge that enables familiar Artisan commands while removing unnecessary overhead.": "Laravel Runtime proporciona un puente Laravel mínimo que habilita comandos Artisan familiares mientras elimina sobrecarga innecesaria.",
    "Laravel-Like Structure": "Estructura Similar a Laravel",
    "Maintains familiar Laravel directory structure (app/, config/, database/) but lightweight.": "Mantiene la estructura de directorios familiar de Laravel (app/, config/, database/) pero ligera.",
    "Essential Commands Only": "Solo Comandos Esenciales",
    "Includes only make:* commands and essential utilities. Removes unnecessary Laravel components.": "Incluye solo comandos make:* y utilidades esenciales. Elimina componentes innecesarios de Laravel.",
    "Complete Module Isolation": "Aislamiento Completo de Módulos",
    "Each module is a self-contained unit with its own dependencies, preventing conflicts with other modules or the parent application.": "Cada módulo es una unidad autónoma con sus propias dependencias, previniendo conflictos con otros módulos o la aplicación padre.",
    "Module Directory Structure": "Estructura de Directorios del Módulo",
    "Independent Shop Module": "Módulo de Tienda Independiente",
    "Module source code": "Código fuente del módulo",
    "Module configuration": "Configuración del módulo",
    "Module migrations & seeders": "Migraciones y seeders del módulo",
    "Module's own dependencies": "Dependencias propias del módulo",
    "Independent from parent": "Independiente del padre",
    "Module-specific dependencies": "Dependencias específicas del módulo",
    "Dependency Resolution": "Resolución de Dependencias",
    "How modules find and load dependencies": "Cómo los módulos encuentran y cargan dependencias",
    "Module Vendor Directory": "Directorio Vendor del Módulo",
    "First checks modules/shop/vendor/ for dependencies. Never looks in parent vendor.": "Primero verifica modules/shop/vendor/ para dependencias. Nunca busca en el vendor padre.",
    "If not found in module, uses elyerr/elymod dependencies. The mini-framework provides core functionality.": "Si no se encuentra en el módulo, usa dependencias de elyerr/elymod. El mini-framework proporciona funcionalidad central.",
    "No Parent Fallback": "Sin Retorno al Padre",
    "Crucially, modules NEVER fall back to parent application dependencies. Complete isolation.": "Crucialmente, los módulos NUNCA recurren a dependencias de la aplicación padre. Aislamiento completo.",
    "Version Safety": "Seguridad de Versiones",
    "Modules can use different dependency versions without conflicting with the parent or other modules.": "Los módulos pueden usar diferentes versiones de dependencias sin conflictos con el padre u otros módulos.",
    "Independent Development": "Desarrollo Independiente",
    "Teams can develop modules independently, without coordinating dependency updates with the main application.": "Los equipos pueden desarrollar módulos independientemente, sin coordinar actualizaciones de dependencias con la aplicación principal.",
    "Easy Distribution": "Distribución Fácil",
    "Modules can be packaged and distributed independently, including all their dependencies.": "Los módulos pueden empaquetarse y distribuirse independientemente, incluyendo todas sus dependencias.",
    "Core Features": "Características Principales",
    "Everything you need for building truly independent OAuth2 modules": "Todo lo que necesitas para construir módulos OAuth2 verdaderamente independientes",
    "Self-Contained Dependencies": "Dependencias Autónomas",
    "Each module installs and manages its own dependencies. No reliance on parent application packages.": "Cada módulo instala y gestiona sus propias dependencias. Sin dependencia de paquetes de la aplicación padre.",
    "Laravel Artisan Commands": "Comandos Laravel Artisan",
    "Full Laravel development experience with make commands, migrations, and familiar workflows.": "Experiencia completa de desarrollo Laravel con comandos make, migraciones y flujos de trabajo familiares.",
    "Service Container Integration": "Integración del Contenedor de Servicios",
    "Full service container support. Modules can register their own service providers and bindings.": "Soporte completo del contenedor de servicios. Los módulos pueden registrar sus propios proveedores de servicios y bindings.",
    "Start Building Independent Modules": "Comienza a Construir Módulos Independientes",
    "Build truly independent OAuth2 modules with Elymod. No dependency conflicts, separate licensing, and familiar Laravel workflow.": "Construye módulos OAuth2 verdaderamente independientes con Elymod. Sin conflictos de dependencias, licencias separadas y flujo de trabajo Laravel familiar.",
    "Get Started on GitHub": "Comenzar en GitHub",
    "View Documentation": "Ver Documentación",
    "A lightweight modular mini‑framework for Laravel OAuth2 modules.": "Un mini-framework modular ligero para módulos Laravel OAuth2.",
    "Resources": "Recursos",
    "Documentation": "Documentación",
    "API Reference": "Referencia de API",
    "Examples": "Ejemplos",
    "Community": "Comunidad",
    "GitHub": "GitHub",
    "Discord": "Discord",
    "Twitter": "Twitter",
    "Legal": "Legal",
    "License": "Licencia",
    "Privacy Policy": "Política de Privacidad",
    "Terms of Use": "Términos de Uso",
    "Modular Mini Framework": "Mini Framework Modular",
    "Designed & built by": "Diseñado y construido por"
}